//Функция ЭкранироватьСимволы(ИсходнаяСтрока) Экспорт
//	Результат = ИсходнаяСтрока;
//	Результат = СтрЗаменить(СокрЛП(Результат),"""","");
//	Результат = СтрЗаменить(СокрЛП(Результат),"(","");
//	Результат = СтрЗаменить(СокрЛП(Результат),")","");
//	Возврат Результат;
//КонецФункции

//Функция ЗаменитьНепечатаемыеСимволы(ИсходнаяСтрока) Экспорт
//	Результат = ИсходнаяСтрока;
//	Результат = СтрЗаменить(СокрЛП(Результат),"№","#");
//	Результат = СтрЗаменить(СокрЛП(Результат),"і","i");
//	Возврат Результат;

//КонецФункции
